# InvalidInsertOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InvalidInsertOrientation Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The insert orientation is incompatible with the wall's cross-section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidInsertOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidInsertOrientation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidInsertOrientation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace